'''
리스트 공간을 먼저 생성
a=[[],[],[],[],[]]
리스트 공간 초기화를 먼저 해주어야함.
for i in range(0,5):
    for j in range(0,5):
        a[0][0] =1
        a[0][1] =2
        a[0][2] =3
        a[0][3] =4
        a[0][4] =5
        a[1][0] =6
        
        
        
        a[i][j] = (5*i)+j+1 

print


  ##알아두기
a=[[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0]]
# 또는   a=[[0]*5] *5    #얕은복사
a= [[0]*5 for _ in range(5)] ##컴프리헨션
print(a)
value=1 
for i in range(0,5): # 0,1,2,3,4
    for j in range(0,5):   #0,1,2,3,4,
        a[i][j] =value  # 외우기 (5*i)+j+1
        value +=1
        print(a)

'''


a=[[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0]]

value=1
for i in range(0,5):
  for j in range(0,5):
    a[i][j]=value
    value += 1
print(a)